# Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

In [1]:
import pandas as pd

### Series

In [2]:
#A one-dimensional labeled array a capable of holding any data type
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

### Data Frame

In [3]:
#A two-dimensional labeled data structure with columns of potentially different types
data = {'Country': ['Belgium', 'India', 'Brazil'],'Capital': ['Brussels', 'New Delhi', 'Brasília'],
        'Population': [11190846, 1303171035, 207847528]}

df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

### Selection

In [4]:
#Get one element
s['a']

3

In [5]:
#Get subset of a DataFrame
df[1:]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

In [6]:
#Select single value by row & column
df.iloc[[2],[0]]

  Country
2  Brazil

In [7]:
#Select single value by row & column labels
df.loc[[2], 'Country']

2    Brazil
Name: Country, dtype: object

In [8]:
#Select single column or rows of subset of columns or rows
df.iloc[[2],:]

  Country   Capital  Population
2  Brazil  Brasília   207847528

In [9]:
#Series s where value is not >1 
s[~(s > 1)]

b   -5
dtype: int64

In [10]:
#s where value is <-1 or >2
s[(s < -1) | (s > 2)]

a    3
b   -5
c    7
d    4
dtype: int64

In [11]:
#Use filter to adjust DataFrame
df[df['Population']<1200000000]

   Country   Capital  Population
0  Belgium  Brussels    11190846
2   Brazil  Brasília   207847528

In [12]:
#Set index a of Series s to 6
s['a'] = 6
s

a    6
b   -5
c    7
d    4
dtype: int64

### Dropping

In [13]:
#Drop values from rows (axis=0)
s.drop(['a', 'c'])

b   -5
d    4
dtype: int64

In [14]:
#Drop values from columns(axis=1)
df.drop('Country', axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

### Sort & Rank

In [15]:
#Sort by labels along an axis
df.sort_index()

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [16]:
#Sort by the values along an axis
df.sort_values(by='Country')

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [17]:
#Assign ranks to entries
df.rank()

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

### DataFrame Information

In [18]:
#Display (rows,columns)
df.shape

(3, 3)

In [19]:
#Describe index
df.index

RangeIndex(start=0, stop=3, step=1)

In [20]:
#Describe DataFrame columns
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [21]:
#Info on DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [22]:
#Number of non-NA values
df.count()

Country       3
Capital       3
Population    3
dtype: int64

In [23]:
#Sum of values
df.sum()

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasília
Population                   1522209409
dtype: object

In [24]:
#Cummulative sum of values 
df.cumsum()

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndia          BrusselsNew Delhi  1314361881
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasília  1522209409

In [25]:
#Minimum value
df.min()

Country        Belgium
Capital       Brasília
Population    11190846
dtype: object

In [26]:
#Maximum value
df.max()

Country            India
Capital        New Delhi
Population    1303171035
dtype: object

In [27]:
#Summary statistics
df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [28]:
#Mean of values
df.mean()

Population    5.074031e+08
dtype: float64

In [29]:
#Median of values
df.median()

Population    207847528.0
dtype: float64

### Applying Functions

In [30]:
#Creating an example function
f = lambda x: x*2

In [31]:
#Apply fucntion
df.apply(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606342070
2    BrazilBrazil    BrasíliaBrasília   415695056

In [32]:
#Apply function element-wise
df.applymap(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606342070
2    BrazilBrazil    BrasíliaBrasília   415695056

### Read and Write

In [33]:
#Read and Write
df = pd.read_csv('data.csv')

In [34]:
#Preview of data
df.head()

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
0,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,38.631913,-121.434879
1,51 OMAHA CT,SACRAMENTO,95823,CA,3,1,1167,Residential,Wed May 21 00:00:00 EDT 2008,68212,38.478902,-121.431028
2,2796 BRANCH ST,SACRAMENTO,95815,CA,2,1,796,Residential,Wed May 21 00:00:00 EDT 2008,68880,38.618305,-121.443839
3,2805 JANETTE WAY,SACRAMENTO,95815,CA,2,1,852,Residential,Wed May 21 00:00:00 EDT 2008,69307,38.616835,-121.439146
4,6001 MCMAHON DR,SACRAMENTO,95824,CA,2,1,797,Residential,Wed May 21 00:00:00 EDT 2008,81900,38.519470,-121.435768

In [35]:
#Sorting by price
df.sort_values(by='price')

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
865,3720 VISTA DE MADERA,LINCOLN,95648,CA,3,3,0,Residential,Fri May 16 00:00:00 EDT 2008,1551,38.851645,-121.231742
866,14151 INDIO DR,SLOUGHHOUSE,95683,CA,3,4,5822,Residential,Fri May 16 00:00:00 EDT 2008,2000,38.490447,-121.129337
580,59 E ST,LINCOLN,95648,CA,3,2,0,Residential,Mon May 19 00:00:00 EDT 2008,4897,38.885794,-121.290281
584,386 1ST ST,LINCOLN,95648,CA,0,0,0,Residential,Mon May 19 00:00:00 EDT 2008,4897,38.886528,-121.288869
585,374 1ST ST,LINCOLN,95648,CA,0,0,0,Residential,Mon May 19 00:00:00 EDT 2008,4897,38.886525,-121.288787
...,...,...,...,...,...,...,...,...,...,...,...,...
553,6222 CALLE MONTALVO CIR,GRANITE BAY,95746,CA,5,3,3670,Residential,Mon May 19 00:00:00 EDT 2008,760000,38.779435,-121.146676
157,315 JUMEL CT,EL DORADO HILLS,95762,CA,6,5,0,Residential,Wed May 21 00:00:00 EDT 2008,830000,38.669931,-121.059580
334,3935 EL MONTE DR,LOOMIS,95650,CA,4,4,1624,Residential,Tue May 20 00:00:00 EDT 2008,839000,38.813337,-121.133348
863,2982 ABERDEEN LN,EL DORADO HILLS,95762,CA,4,3,0,Residential,Fri May 16 00:00:00 EDT 2008,879000,38.706692,-121.058869
864,9401 BARREL RACER CT,WILTON,95693,CA,4,3,4400,Residential,Fri May 16 00:00:00 EDT 2008,884790,38.415298,-121.194858